#==============================================================================
# set은 집합연산을 하기 위한 데이터 타입입니다
# 순서가 없어 인덱스로 검색이 불가능하며
# 항목을 수정할수 있고 중복이 불가능합니다
#==============================================================================

#==============================================================================
#                               집합 함수
#------------------------------------------------------------------------------
# intersection() : 교집합 & 연산자로 사용가능
# union() : 합집합 | 연산자로 사용가능
# difference() : 차집합 - 연산자로 사용가능
# isdisjoint() : 집합에 공통된 부분없이 아예 다른지 비교
#------------------------------------------------------------------------------
a = {1,2,3,4,5,6}
b = {4,5,6,7,8,9}
c = {'a','b','c'}
print("="*20,"튜플 함수","="*20)
print(f"a : {a}")
print(f"b : {b}")
print(f"c : {c}")
print("-"*50)
print(f'a.intersection(b) : {a.intersection(b)}\t\t\ta&b : {a&b}')
print(f'a.union(b) : {a.union(b)}\ta|b : {a|b}')
print(f'a.difference(b) : {a.difference(b)}\t\t\ta-b : {a-b}')
print(f'a.isdisjoint(b) : {a.isdisjoint(b)}\t\t\t\ta.isdisjoint(c) : {a.isdisjoint(c)}')
print("="*50)
#==============================================================================